const dialogues = [
    {
        title: "1 Greetings and Introductions: Basic phrases for meeting and introducing oneself:",
        content: `
            Person 1: Привет! Меня зовут Сара. Как вас зовут? <br><br>

Person 2: Привет, Сара! Меня зовут Маркос. или Маркос, как обычно называют меня русские люди. Приятно познакомиться!<br><br>

Person 1: Приятно познакомиться, Маркос. Вы новенький здесь?<br><br>

Person 2: Да, я здесь новичок, я только что приехал, я только на прошлой неделе переехал. Я все еще знакомлюсь с окрестностями, чтобы узнать место лучше, где находятся магазины, парки, и т.д, все такое прочее, пока что город мне нравился, но я все еще привыкаю к ​​этому. мне нужно еще немного времени, чтобы привыкнуть, потому что я здесь еще ничего не знаю. типа, я знаю только, как добраться до университета и все, на данный момент достаточно, потому что люди там помогают мне, если у меня возникают какие-то сомнения, или если возникнут какие-либо проблемы, Так что, хотя теоретически мы близки к Украине я чувствую себя в безопасности, из-за конфликта некоторые люди из моей семьи боялись,  что я приеду сюда, и они не ошибаются, я их понимаю, Бабушка очень волновалас, что я приеду сюда, но я им все объяснил, и на этом все.<br><br>


Person 1: Ну, добро пожаловать! Я уверена, вам здесь понравится. Откуда вы переехали?<br><br>

Person 2: Большое спасибо! мне это уже понравилось с первого взгляда, Я переехал из Бразилии. я бразилец, а вы, Из какого вы города? где вы живете?<br><br>


Person 1: Я здесь всю жизнь живу. Это замечательный город. Так что, что привело вас в эту часть города?<br><br>


Person 2: Ну, я живу недалеко отсюда, в общежитии, Я пришел сюда будучи студентом, и я нашел работу неподалеку, поэтому решил переехать сюда. А вы, чем занимаетесь? Чем вы зарабатываете на жизнь? если вы не возражаете против вопроса.<br><br>

Person 1: Я графический дизайнер. Работаю в студии в соседней улице. Это интересная работа.<br><br>


Person 2: Да, я согласен, когда-то я подумывал о том, чтобы поработать в этой области, но в итоге отказался от этого. может быть, я не хотел этого по-настоящему, или, может быть, я просто не для этого рожден, кто знает, на самом деле я даже не пытался, я только думал о такой возможности, но, эта профессия звучит интересно! даже больше, потому что Мне нравится заниматься тем, что использует мой творческий потенциал, будь то рисование, работа или бизнес-проект, что бы это ни было, мне нужно использовать творческий потенциал, Именно поэтому Я сам занимаюсь маркетингом, я мог бы нанять кого-нибудь, но поскольку мне нравится что-то делать, я делаю это сам, я бы нанял кого-нибудь только в том случае, если бы действительно не знал, как это делается, или если это слишком скучно.. Может быть, мы когда-нибудь пересечемся профессионально. Может быть, когда-нибудь наши пути пересекутся.<br><br>


Person 1: Конечно! Ну, было приятно познакомиться, Маркос. Если вам когда-нибудь понадобится что-то или просто выпить кофе, заходите.<br><br>

Person 2: Конечно! без сомнения, Спасибо, Сара! Я обязательно воспользуюсь. Хорошего дня!
        `
    },
    {
        title: "2 Everyday Activities: Talking about daily routines, such as waking up, eating meals, going to school or work, and sleeping.",
        content: `
           Person 1: Привет, Наташа! Как прошла твой день?<br><br>

Person 2: Привет, Андрей! День прошел хорошо, спасибо. С утра встала, позавтракала и пошла на работу. А как твой день?<br><br>


Person 1: У меня тоже все хорошо. Проснулся, позавтракал, потом сходил в спортзал. Потом пошел на работу.<br><br>


Person 2: Какой у тебя обычно завтрак?<br><br>

Person 1: что это за вопрос? братан.<br><br>

Person 2: просто вопрос, ничего особенного<br><br>

Person 1: ok, Обычно я ем омлет с овощами и хлеб с маслом. А ты?<br><br>

Person 2: Я предпочитаю йогурт с фруктами и овсянку.<br><br>

Person 1: Звучит здорово! это обычное блюдо в России? А вечером, что ты обычно делаешь?<br><br>

Person 2: Обычно я возвращаюсь домой, я прихожу домой с работы и принимаю душ, ужинаю и потом читаю книгу перед сном. А ты?<br><br>

Person 1: Кстати, я приму душ, я уже 6 дней не принимаю душ, kkk просто шучу, я люблю шутить, а что вы обычно едите на ужин?<br><br>

Person 2: Это зависит от обстоятельств, не всегда одно и то же, иногда это может быть суп, или салат, или грибы, или картофель, или рыба, А ты, Что ты делаешь, что ты обычно ешь на ужин?<br><br>

Person 1: Грибы? Боже упаси, я бы не стал это есть, боюсь (Забыл слово, но это редкость, бывает раз в 2 минуты.) умереть, я знаю, что не умру, но, Я никогда в жизни раньше не ела грибов, Некоторые говорят, что это ядовито, но я знаю, что есть и другие варианты, ядовитые и неядовитые, обычно мы здесь это не едим.<br><br>

Person 1: Ну, что касается вашего вопроса, вообще-то я работаю дома, и здесь, в Бразилии, мы обычно едим рис, может быть, это из-за азиатского влияния, Тысячи азиатов иммигрировали Бразилию на протяжении всей истории, и именно поэтому в нашей стране миллионы выходцев из Азии, я имею в виду не азиатов, а их потомков, они потомки азиатов, возвращаясь к теме, о чем мы говорили? ah, ok, но мы также едим фасоль, макароны, салат, красное мясо, например, говядину, картофель, рыба, но, конечно, не каждый день, иногда люди готовят что-то другое, например лазанья и т.д., Но чаще всего мы едим рис, фасоль, макароны, мясо, салат и т.д. всегда с очень вкусными приправами. Кроме того, мы едим много фруктов, потому что здесь они очень дешевые по сравнению с Россией, потому что их производят здесь. Так что логично, что здесь это дешевле, чем в россии, потому что они импортируют, Некоторые говорят, что здешние фрукты вкуснее, но я не знаю, правда ли это, Я тоже ужинаю, потом смотрю фильм или сериал.<br><br>

Person 2: Какой фильм ты смотрел вчера?<br><br>

Person 1: Вчера я посмотрел новый фильм про приключения, когда я говорю по-английски, очень сложно переключиться на русский, английские слова постоянно приходят на ум<br><br>

Person 2: Звучит интересно! Может, я его тоже посмотрю.

        `
    },
    
    {
        title: "3 Family and Relationships Vocabulary related to family members, describing people, and discussing relationships.",
        content: ` Person 1: Привет, Иван! Как дела?<br><br>

            Person 2: Привет, Мария! Всё отлично, спасибо. А у тебя?<br><br>

            Person 1: Тоже всё хорошо. Как твоя семья?<br><br>

            Person 2: Они тоже в порядке, спасибо за спрос. А у тебя, как твои родители?<br><br>

            Person 1: Мои родители в порядке, спасибо. У моего брата скоро день рождения, мы планируем собраться всей семьей.<br><br>

            Person 2: Это правда круто, от меня поздравления твоему брату, кстати, как зовут твоих родителей?<br><br>

            Person 1: Владимир и Аня, а твой?<br><br>
 
Person 2: их зовут Маркос и Элизанджела.<br><br>

Person 2: Как замечательно! Сколько у вас членов в семье?<br><br>

Person 1: У нас пятеро - я, мои родители, брат и сестра. А у тебя?<br><br>

Person 2: У нас немного больше - шестеро. Я, мои родители, две сестры и два брата.<br><br>

Person 1: Звучит как весело! Какие отношения у вас в семье?<br><br>

Person 2: Мы все очень близкие. Мы всегда поддерживаем друг друга и проводим много времени вместе.<br><br>

Person 1: Это замечательно. У нас тоже очень теплые отношения. Наша семья всегда важна для меня.<br><br>

Person 2: Понимаю тебя. Семья - это самое важное в жизни.<br><br>
            
        `
    },

    {
        title: "4 School or Work, Vocabulary related to professions, studies, and workplace environments.",
        content: `
        Person 1: Привет, Алексей! Как прошел твой день на работе?<br><br>

Person 2: Привет, Ольга! День был довольно насыщенным. У нас было много встреч и задач по проекту. А как у тебя в университете?<br><br>

Person 1: В университете тоже было интересно. У нас сегодня была лекция по маркетингу. Мы обсуждали новые стратегии продвижения.<br><br>
Person 2: Звучит интересно! А в какой сфере ты планируешь работать после университета?<br><br>

Person 1: Я учусь на экономиста, так что хочу найти работу в области финансов или аналитики. А ты, какую профессию выбрал?<br><br>

Person 2: Я работаю в IT-компании как программист. Я люблю разрабатывать новые программы и решать сложные задачи.<br><br>

Person 1: Звучит увлекательно! Какие проекты сейчас у тебя на работе?<br><br>


Person 2: Сейчас мы работаем над разработкой нового приложения для мобильных устройств. Это очень интересный проект, и я надеюсь, что мы скоро его завершим.<br><br>

Person 1: Удачи вам с проектом! А у меня завтра экзамен, так что мне пора идти домой и готовиться. До встречи!<br><br>

Person 2: Удачи на экзамене, Ольга! До скорой встречи!
            
        `
    },

    {
        title: "5 Hobbies and Interests, Discussing activities and interests such as sports, music, movies, and books.",
        content: `
        Person 1: Привет, Антон! Чем занимался на выходных?<br><br>

Person 2: Привет, Наташа! В выходные я с друзьями сходил на футбольный матч. Это было очень весело! А ты?<br><br>

Person 1: Я в выходные ходила в кино с семьей. Мы посмотрели новый фильм про приключения. Очень понравилось!<br><br>

Person 2: Звучит здорово! Какой еще вид развлечений тебе нравится?<br><br>

Person 1: Мне нравится читать книги. В последнее время я увлечена фантастикой. А ты, какие у тебя хобби?<br><br>

Person 2: Я люблю играть на гитаре. У меня дома есть несколько музыкальных инструментов, и я часто провожу время за музыкой.<br><br>

Person 1: Это замечательно! Ты умеешь играть какие-то песни?<br><br>

Person 2: Да, я учился играть разные песни. В основном это рок и популярные мелодии.<br><br>

Person 1: Как здорово! Может быть, ты сможешь сыграть что-то для нас в следующий раз, когда встретимся с друзьями?<br><br>

Person 2: Конечно, с удовольствием! Буду рад порадовать вас своей музыкой.
            
        `
    },

    {
        title: "6 Plans and Future Events Talking about future plans, activities, and events. ",
        content: `
        Person 1: Привет, Дмитрий! Что у тебя запланировано на этот выходной?<br><br>

Person 2: Привет, Алексей! Я планирую сходить на выставку и после этого встретиться с друзьями в кафе. А у тебя есть какие-то планы?<br><br>

Person 1: Я тоже хочу посетить выставку, но позже в день. Утром у меня тренировка по футболу с друзьями. После этого, возможно, пойду в парк на прогулку.<br><br>

Person 2: Как замечательно! А после прогулки можем встретиться и вместе пойти на выставку. Что скажешь?<br><br>

Person 1: Звучит отлично! Давай так и сделаем. А что касается вечера, у меня нет конкретных планов. Может быть, пойду в кино или останусь дома и почитаю книгу.<br><br>

Person 2: А я планирую посетить концерт вечером. Может быть, после выставки ты также захочешь присоединиться ко мне?<br><br>

Person 1: Возможно, это звучит интересно! Давай решим ближе к вечеру. Но в любом случае, выходные обещают быть интересными и насыщенными!<br><br>

Person 2: Согласен! Будет здорово провести время вместе. До встречи на выставке, Алексей!

            
        `
    },

    {
        title: "7 Shopping, dining out, and using services like transportation or banking.",
        content: `
        Person 1: Привет, Елена! Как прошел твой день?<br><br>

Person 2: Привет, Анна! День был довольно насыщенным. Я сходила в торговый центр, чтобы купить новую сумку и пару подарков к дню рождения подруги. А у тебя?<br><br>

Person 1: У меня был довольно спокойный день. Я зашла в магазин, чтобы купить продукты на ужин. А какие подарки ты выбрала для подруги?<br><br>

Person 2: Я купила ей красивый шарф и набор ароматических свечей. Она обожает такие подарки. А ты, что планируешь приготовить на ужин?<br><br>

Person 1: Я думаю приготовить пасту с овощами и курицей. Это быстро и вкусно. А после ужина, может быть, пойдем в кафе выпить кофе?<br><br>


Person 2: Звучит замечательно! Я в этом сейчас нуждаюсь после такого насыщенного дня. А как ты обычно добираешься до магазина?<br><br>

Person 1: Обычно я пользуюсь общественным транспортом. У нас здесь хорошо развита сеть автобусов и метро. А ты?<br><br>

Person 2: Я обычно предпочитаю ездить на своей машине. Это удобно, особенно когда нужно перевезти большие покупки.<br><br>

Person 1: Понимаю тебя. Ну что ж, давай завтра встретимся в кафе и поделимся впечатлениями от покупок.<br><br>

Person 2: Согласна! Будет здорово повидаться. До завтра, Анна!

            
        `
    },

    {
        title: "8 Travel, Basic travel-related vocabulary and phrases for navigating in a new place or country.",
        content: `
        Person 1: Привет, Андрей! Какие у тебя планы на отпуск?<br><br>

Person 2: Привет, Ольга! Я планирую поехать в отпуск в следующем месяце. Мы с семьей собираемся посетить Лондон. Это будет наша первая поездка в этот город. А у тебя были планы на отпуск?<br><br>

Person 1: Нет, пока я не решила, куда поехать. Но я думаю о поездке в Италию. Я всегда мечтала посетить Рим и Флоренцию.<br><br>


Person 2: Звучит замечательно! Ты точно должна поехать. А когда ты планируешь сделать эту поездку?<br><br>

Person 1: Я думаю, что летом. Это будет лучшее время для посещения Италии, когда погода теплая и солнечная.<br><br>

Person 2: А как ты планируешь добираться до Италии?<br><br>

Person 1: Я думаю, что лучше всего будет полететь на самолете. Это быстро и удобно. А как вы планируете добираться до Лондона?<br><br>

Person 2: Да, мы тоже собираемся лететь на самолете. Мы уже забронировали билеты и выбрали отель в центре города. Мы очень ждем этой поездки!<br><br>

Person 1: Я вижу, Понимаю вас. Путешествия всегда такие захватывающие! Ну что ж, желаю вам отлично провести время в Лондоне. А я продолжу планировать свою поездку в Италию.<br><br>

Person 2: Спасибо, Ольга! Ты тоже не забудь поделиться впечатлениями от своей поездки. Удачи вам в планировании и приятного путешествия!
            
        `
    },

    {
        title: "9 Health and Well-being, Basic medical vocabulary, discussing feelings, and describing health-related issues.",
        content: `
         Person 1: Привет, Андрей. Как твое здоровье? Ты выглядишь немного бледным.<br><br>


Person 2: Привет, Олег. Да, сейчас я не себе. У меня головная боль уже несколько дней, и я чувствую себя слабым.<br><br>

Person 1: Наверное, стоит пойти к врачу и проконсультироваться. Может быть, это просто простуда или что-то серьезнее.<br><br>

Person 2: Да, я думаю, что ты прав. Я планирую записаться на прием к терапевту на этой неделе. Не мог бы ты мне помочь найти информацию о ближайшей поликлинике?<br><br>

Person 1: Конечно, я могу помочь. Давай вместе найдем информацию. Мне кажется, что важно не откладывать визит к врачу, особенно если ты чувствуешь себя плохо уже несколько дней.<br><br>

Person 2: Спасибо, Олег. Я также начну вести записи о своем самочувствии и о том, какие симптомы у меня есть. Это поможет врачу лучше понять, что со мной происходит.<br><br>

Person 1: Это хорошая идея. Также обрати внимание на свой режим дня, попробуй выспаться и питаться здоровой пищей. Надеюсь, ты скоро почувствуешь себя лучше.<br><br>


Person 2: Спасибо за советы, Олег. Я обязательно их учту. В любом случае, я думаю, что важно слушать свое тело и заботиться о своем здоровье.<br><br>


Person 1: Точно, забота о здоровье самое важное. Если у тебя появятся какие-то обновления или вопросы, не стесняйся обращаться. Желаю тебе скорейшего выздоровления, Андрей.<br><br>


Person 2: Спасибо, Олег. Я тоже буду тебя информировать о своем состоянии. Береги себя.
            
        `
    },

    {
        title: "10 Weather and Seasons, Vocabulary related to weather conditions and seasons.",
        content: `
            
        `
    },


];

let currentIndex = 0;

function highlightSpeakers(content) {
    return content
        .replace(/Person 1:/g, '<span class="highlight-yellow">Person 1:</span>')
        .replace(/Person 2:/g, '<span class="highlight-red">Person 2:</span>');
}

function updateDialogue(index) {
    const title = document.getElementById("title");
    const content = document.getElementById("content");
    title.innerHTML = dialogues[index].title;
    content.innerHTML = highlightSpeakers(dialogues[index].content);
}

document.getElementById("prev").addEventListener("click", () => {
    currentIndex = (currentIndex - 1 + dialogues.length) % dialogues.length;
    updateDialogue(currentIndex);
});

document.getElementById("next").addEventListener("click", () => {
    currentIndex = (currentIndex + 1) % dialogues.length;
    updateDialogue(currentIndex);
});

// Initial dialogue load
updateDialogue(currentIndex);
